{"Meal": "breakfast", "Cuisine": "american", "Full Name": "Avocado Toast", "Name": "avocado", "Ingredients": "Bread,\nButter,\nAvocado,\nSalt, \nPepper,\nRed Pepper", "Prep Time": "10 min", "Recipe": "1. Toast the bread until golden brown\n2. Spread an even layer of butter on the warm bread\n3. Slice half an avocado into 1/8 inch slices\n4. Fan out the slices on the toast \n5. Season with salt, pepper and red pepper"}
{"Meal": "entrée", "Cuisine": "american", "Full Name": "Stir-Fry Quinoa", "Name": "quinoa", "Ingredients": "Quinoa,\nBroccoli,\nZucchini,\nGreen Bell Pepper,\nSoy Sauce,\nSalt,Pepper,\nOregano", "Prep Time": "20 min", "Recipe": "1. Cook the quinoa in water with a pinch of salt for 15 min\n2. Cut the broccoli into medium size florets and slice the zucchini and bell pepper into 1.5 inch strips\n3. Sauté the vegetables in 1tbs oil, 2tbs of soy sauce and salt, pepper and oregano for 3 min\n4. Mix the quinoa into the stir fry"}
{"Meal": "dessert", "Cuisine": "american", "Full Name": "Chocolate Chip Cookies", "Name": "chocchipcookies", "Ingredients": "\nAll purpose flour,\nButter,\nChopped walnuts (optional),\nChocolate chips,\nBaking soda,\nSalt,\nGranulated sugar,\nLight brown sugar,\nVanilla,\nEggs", "Prep Time": "30 min", "Recipe": "1. Mix all dry ingredients together (flour, salt, baking soda)\n2. Cream the butter, then add in both sugar, eggs, and vanilla\n3. Mix dry ingredients into wet ones\n4. Stir in nuts and chocolate chips\n5. (Optional) omit chocolate chips and roll dough in cinnamon and sugar for snickerdoodles"}
{"Meal": "dessert", "Cuisine": "american", "Full Name": "Buttercream", "Name": "buttercream", "Ingredients": "Butter,\nPowdered sugar,\nVanilla essense,\nMilk", "Prep Time": "10-20 min", "Recipe": "1. Beat 1/2 cup softened butter in a kitchen aid mixture for 5-7 minutes until white and fluffy\n2. Slowly add 3 cups sifted powdered sugar into butter mixture\n3. Once all the sugar and butter are mixed, add 1 tsp vanilla essence and 1 tbsp milk"}
{"Meal": "dessert", "Cuisine": "american", "Full Name": "Cake Box Cake", "Name": "cake", "Ingredients": "Cake box,\nEvaporated milk,\nSour cream,\nVegetable oil", "Prep Time": "50-60 min", "Recipe": "1. Mix cake mix with wet ingredients in a kitchen aid mixer or by whisk till all lumps are removed\n2. Bake at 350 degrees F in cake pan for 45-50 minutes or cupcake tray for 15-20 minutes"}
{"Meal": "entrée", "Cuisine": "american", "Full Name": "Buffalo Cauliflower", "Name": "cauliwings", "Ingredients": "Panko breadcrumbs, Milk, All purpose flour, Salt, Hot sauce, Unsalted butter, Cauliflower", "Prep Time": "30 min", "Recipe": "1. Preheat oven to 400 degrees F.\n2. Cut off the cauliflower florets.\n3. Mix 1 cup milk, 3/4 flour, and 1 tsp salt until batter is formed. Once combined add in a teaspoon of hot sauce in the mixture.\n4. Pour 1 cup breadcrumbs into a shallow bowl. Dip cauliflower into the batter and then panko coating completely and place on an oiled tray.\n5. Melt 1 1/2 tsp butter and add in 1/4 cup hot sauce. Coat cauliflower with hot sauce mixture.\n6. Bake cauliflower for 15-20 minute depending on size."}
{"Meal": "breakfast", "Cuisine": "american", "Full Name": "Crispy Waffles", "Name": "waffles", "Ingredients": "All purpose flour, Sugar, Baking powder, Salt, Cinnamon, Nutmeg, Egg, Milk, Butter, Vanilla extract", "Prep Time": "10 min", "Recipe": "1. Preheat waffle iron.\n2. In a large bowl, whisk together dry ingredients: 2 cups flour, 2 tbsp sugar, 4 tsp baking powder, and 1 tsp salt.\n3, In another bowl, combine 2 eggs with the 1 1/2 cup warm milk. Then add 6 tbsp melted butter and 1 tsp vanilla.\n4. Pour the wet ingredients into the dry ones and whisk until blended.\n5. Ladle about ½ cup of batter into the preheated waffle iron. Cook until waffles are golden brown and crispy.\n6. Serve immediately with preferred toppings and syrup or place in Ziploc and freeze."}
{"Meal": "entrée", "Cuisine": "mexican", "Full Name": "Mini Mexican Pizza", "Name": "mexican-pizza", "Ingredients": "Mini phyllo shells, Black beans, Bell peppers, Cheddar, Pepperjack, Serrano pepper, Salt, Pepper", "Prep Time": "20 min ", "Recipe": "1. Preheat oven to 350 degrees F. Thaw frozen phyllo shells.\n2. Smash black beans with little bit of water, until mushy. Add in bell peppers and season with salt and pepper. Add cut up chili peppers.\n3. Place about a teaspoon or two of mixture into the phyllo shells. Cover the top of the shell with cheese mixture.\n4. Bake about 10-15 minutes until cheese is melted and shells are golden brown.\n5. Serve warm with hot sauce."}
{"Meal": "entrée", "Cuisine": "american", "Full Name": "Spinach Cheese Puffs", "Name": "spinach-puffs", "Ingredients": "Cream cheese, Egg, Olive oil, Dried dill, Spinach, Feta, Sharp cheddar, Monterey jack, Salt, Pepper, Frozen puff pastry, Butter", "Prep Time": "30 min", "Recipe": "1. Preheat oven to 400 degrees and spray muffin pan with cooking spray.\n2. Microwave cream cheese at 15 second intervals until melted completely but not steaming. Add egg, oil, and dill into cream cheese and mix until well combined.\n3. In a separate bowl, combine spinach, feta, cheddar, and jack cheese.\n4. Pour cream cheese mixture on top and season with salt and pepper. Combine together.\n5. Place squares of puff pastry into each muffin compartment, pressing into the bottom on the pan. Divide the spinach evenly among the cups. Press the points of pastry together at the top, covering the filling. Lightly brush the tops with melted butter.\n6. Bake about 20 minutes until golden and puffy. Allow to cool 10 minutes in pan before removing. Cut with knife around the edge to help loosen the pastry."}
{"Meal": "dessert", "Cuisine": "american", "Full Name": "Oreo Truffles", "Name": "oreo-truffles", "Ingredients": "Oreos, Cream cheese, Coating chocolate", "Prep Time": "30 min", "Recipe": "1. Crush the oreos and mix well with the cream cheese.\n2. Roll mixtures into little balls and chill in the fridge for about 30 minutes.\n3. Melt coating chocolate and coat little balls and sprinkle toppings.\n4. Place in fridge until ready to serve."}
{"Meal": "dessert", "Cuisine": "american", "Full Name": "Mint Truffles", "Name": "mint-truffles", "Ingredients": "White chocolate, Heavy whipping cream, Peppermint extract, Chocolate coatiing, Crushed peppermint candy", "Prep Time": "1-2 hrs", "Recipe": "1. Simmer heavy whipping cream then add to chocolate and mix until smooth. Mix in peppermint extract.\n2. Let chocolate ganache chill completely in the fridge overnight or 2-3 hours minimum.\n3. Roll into balls and coat balls in coating chocolate. Top with drizzled white chocolate and crushed peppermint candy.\n4. Refrigerate until ready to serve."}
